bazhen-paseka/LoRa-Contact-stm32f103/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CH0_Pin GPIO_PIN_0
#define CH0_GPIO_Port GPIOA
#define CH0_EXTI_IRQn EXTI0_IRQn
#define LED2_Pin GPIO_PIN_1
#define LED2_GPIO_Port GPIOA
#define CH2_Pin GPIO_PIN_2
#define CH2_GPIO_Port GPIOA
#define CH2_EXTI_IRQn EXTI2_IRQn
#define NSS_Pin GPIO_PIN_4
#define NSS_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_0
#define LED_GPIO_Port GPIOB
#define RESET_Pin GPIO_PIN_1
#define RESET_GPIO_Port GPIOB
#define DIO0_Pin GPIO_PIN_8
#define DIO0_GPIO_Port GPIOA
#define CH3_Pin GPIO_PIN_3
#define CH3_GPIO_Port GPIOB
#define CH3_EXTI_IRQn EXTI3_IRQn
#define CH4_Pin GPIO_PIN_4
#define CH4_GPIO_Port GPIOB
#define CH4_EXTI_IRQn EXTI4_IRQn
#define CH5_Pin GPIO_PIN_5
#define CH5_GPIO_Port GPIOB
#define CH5_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
